tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/
/* Control transfer message */
usb_utr_t g_usb_shhub_ctrl_mess[USB_NUM_USBIP];

/* Data transfer message */
usb_utr_t g_usb_shhub_data_mess[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* HUB descriptor */
uint8_t g_usb_hhub_descriptor[USB_NUM_USBIP][USB_CONFIGSIZE];

/* HUB status data */
uint8_t g_usb_hhub_data[USB_NUM_USBIP][USB_MAXDEVADDR + 1u][8];

/* HUB downport status */
uint16_t g_usb_shhub_down_port[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* Downport remotewakeup */
uint16_t g_usb_shhub_remote[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* Up-hubaddr, up-hubport, portnum, pipenum */
usb_hub_info_t g_usb_shhub_info_data[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];
uint16_t g_usb_shhub_number[USB_NUM_USBIP];
uint16_t g_usb_shhub_class_request[USB_NUM_USBIP][5];

/* Condition compilation by the difference of USB function */
#if USB_NUM_USBIP == 2
uint16_t g_usb_shhub_class_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_init_seq[USB_NUM_USBIP]    = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_init_port[USB_NUM_USBIP]   = {USB_HUB_P1,  USB_HUB_P1};
uint16_t g_usb_shhub_event_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_event_port[USB_NUM_USBIP]  = {USB_HUB_P1,  USB_HUB_P1};
uint16_t g_usb_shhub_attach_seq[USB_NUM_USBIP]  = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_reset_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_state[USB_NUM_USBIP]       = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_info[USB_NUM_USBIP]        = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_hub_addr[USB_NUM_USBIP]    = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_process[USB_NUM_USBIP]     = {USB_SEQ_0,   USB_SEQ_0};
#else   /* USB_NUM_USBIP == 2 */
uint16_t g_usb_shhub_class_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_init_seq[USB_NUM_USBIP]    = {USB_SEQ_0};
uint16_t g_usb_shhub_init_port[USB_NUM_USBIP]   = {USB_HUB_P1};
uint16_t g_usb_shhub_event_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_event_port[USB_NUM_USBIP]  = {USB_HUB_P1};
uint16_t g_usb_shhub_attach_seq[USB_NUM_USBIP]  = {USB_SEQ_0};
uint16_t g_usb_shhub_reset_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_state[USB_NUM_USBIP]       = {USB_SEQ_0};
uint16_t g_usb_shhub_info[USB_NUM_USBIP]        = {USB_SEQ_0};
uint16_t g_usb_shhub_hub_addr[USB_NUM_USBIP]    = {USB_SEQ_0};
uint16_t g_usb_shhub_process[USB_NUM_USBIP]     = {USB_SEQ_0};

#endif  /* USB_NUM_USBIP == 2 */

uint8_t *g_p_usb_shhub_device_table[USB_NUM_USBIP];
uint8_t *g_p_usb_shhub_config_table[USB_NUM_USBIP];
uint8_t *g_p_usb_shhub_interface_table[USB_NUM_USBIP];
uint16_t g_usb_shhub_spec[USB_NUM_USBIP];
uint16_t g_usb_shhub_root[USB_NUM_USBIP];
uint16_t g_usb_shhub_speed[USB_NUM_USBIP];
uint16_t g_usb_shhub_dev_addr[USB_NUM_USBIP];
uint16_t g_usb_shhub_index[USB_NUM_USBIP];

const uint16_t g_usb_hhub_tpl[4] =
{
    USB_CFG_HUB_TPLCNT, /* Number of tpl table */
    0, /* Reserved */
    USB_CFG_HUB_TPL /* Vendor ID, Product ID */
};

/* Host hub Pipe Information Table (endpoint table) definition */
uint16_t g_usb_hhub_def_ep_tbl[USB_NUM_USBIP][USB_EPL + 1] =
{
    {
        /* PIPE9 Definition */
        USB_PIPE9,
        USB_NULL | USB_BFREOFF | USB_CFG_DBLBOFF | USB_CFG_CNTMDOFF | USB_CFG_SHTNAKOFF | USB_NULL | USB_NULL,
        (uint16_t) USB_BUF_SIZE(64u) | USB_BUF_NUMB(7u),
        USB_NULL,
        USB_NULL,
        USB_CUSE,
        USB_PDTBLEND, /* Pipe end */
    },
#if USB_NUM_USBIP == 2
    {
        /* PIPE9 Definition */
        USB_PIPE9,
        USB_NULL | USB_BFREOFF | USB_CFG_DBLBOFF | USB_CFG_CNTMDOFF | USB_CFG_SHTNAKOFF | USB_NULL | USB_NULL,
        (uint16_t)USB_BUF_SIZE(64u) | USB_BUF_NUMB(7u),
        USB_NULL,
        USB_NULL,
        USB_CUSE,
        /* Pipe end */
        USB_PDTBLEND,
    }
#endif  /* USB_NUM_USBIP == 2 */
};

/* Host hub temporary Pipe Information Table ("endpoint table") definition */
uint16_t g_usb_hhub_tmp_ep_tbl[USB_NUM_USBIP][USB_EPL + 1] =
{
    {
         /* PIPE9 Definition */
        USB_PIPE9,
        USB_NULL | USB_BFREOFF | USB_CFG_DBLBOFF | USB_CFG_CNTMDOFF | USB_CFG_SHTNAKOFF | USB_NULL | USB_NULL,
        (uint16_t) USB_BUF_SIZE(64u) | USB_BUF_NUMB(7u),
        USB_NULL,
        USB_NULL,
        USB_CUSE,
        USB_PDTBLEND, /* Pipe end */
    },
#if USB_NUM_USBIP == 2
    {
        /* PIPE9 Definition */
        USB_PIPE9,
        USB_NULL | USB_BFREOFF | USB_CFG_DBLBOFF | USB_CFG_CNTMDOFF | USB_CFG_SHTNAKOFF | USB_NULL | USB_NULL,
        (uint16_t)USB_BUF_SIZE(64u) | USB_BUF_NUMB(7u),
        USB_NULL,
        USB_NULL,
        USB_CUSE,
        /* Pipe end */
        USB_PDTBLEND,
    }
#endif  /* USB_NUM_USBIP == 2 */
};

/******************************************************************************
 Exported global variables
 ******************************************************************************/
/*extern uint16_t    hw_usb_hread_devadd(usb_utr_t *ptr, uint16_t devadr);*/

/* Enumeration request */
/*extern uint16_t   g_usb_hstd_enum_seq[2u];*/
extern uint8_t g_usb_hstd_class_data[][512];

extern void (*g_usb_hstd_enumaration_process[]) (usb_utr_t *, uint16_t, uint16_t);

/******************************************************************************
 Renesas Abstracted Hub Driver API functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_open
 Description     : HUB sys open
 Arguments       : uint16_t devaddr : Device address
                 : uint16_t data2   : Not used
 Return value    : usb_er_t         : Error Info
 ******************************************************************************/
void usb_hhub_open (usb_utr_t *ptr, uint16_t devaddr, uint16_t data2)
{
    usb_er_t err, err2;
    usb_mh_t p_blf;
    usb_mgrinfo_t *mp;
    uint16_t hubaddr, index;

    err = USB_ERROR;
    hubaddr = (uint16_t) (devaddr << USB_DEVADDRBIT);
    index = usb_hhub_chk_tbl_indx1(ptr, devaddr);

    if (USB_MAXHUB != g_usb_shhub_number[ptr->ip])
    {
        /* Wait 10ms */
        usb_cpu_delay_xms((uint16_t) 10);
        err = USB_PGET_BLK(USB_HUB_MPL, &p_blf);
        if (USB_OK == err)
        {
            mp = (usb_mgrinfo_t*) p_blf;
            mp->msghead = (usb_mh_t) USB_NULL;
            mp->msginfo = USB_MSG_CLS_INIT;
            mp->keyword = devaddr;

            mp->ipp = ptr->ipp;
            mp->ip = ptr->ip;

            /* Send message */
            err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
            if (USB_OK != err)
            {
                /* Send Message failure */
                USB_PRINTF1("### hHubOpen snd_msg error (%ld)\n", err);
                err2 = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
                if (USB_OK != err2)
                {
                    USB_PRINTF1("### hHubOpen rel_blk error (%ld)\n", err2);
                }
            }
        }
        else
        {
            /* Release memory block failure */
            USB_PRINTF1("### hHubOpen pget_blk error (%ld)\n", err);
            while (1)
            {
                /* Non */
            }
        }

