tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
        /* Pipe number set */
        g_usb_shhub_info_data[ptr->ip][devaddr].pipe_num = g_usb_hhub_tmp_ep_tbl[ptr->ip][index];

        /* HUB downport status */
        g_usb_shhub_down_port[ptr->ip][devaddr] = 0;

        /* Downport remotewakeup */
        g_usb_shhub_remote[ptr->ip][devaddr] = 0;
        g_usb_hhub_tmp_ep_tbl[ptr->ip][index + 3] |= hubaddr;
        usb_hstd_set_pipe_info(&g_usb_hhub_def_ep_tbl[ptr->ip][index], &g_usb_hhub_tmp_ep_tbl[ptr->ip][index],
                (uint16_t) USB_EPL);

        g_usb_shhub_process[ptr->ip] = USB_MSG_CLS_INIT;
        usb_hstd_set_pipe_registration(ptr, (uint16_t*) &g_usb_hhub_def_ep_tbl[ptr->ip],
                g_usb_hhub_def_ep_tbl[ptr->ip][index]);

        g_usb_shhub_number[ptr->ip]++;
    }
}
/******************************************************************************
 End of function usb_hhub_open
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_close
 Description     : HUB sys close
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr : Hub address
                 : uint16_t data2   : Not used
 Return value    : usb_er_t         : Error Info
 ******************************************************************************/
void usb_hhub_close (usb_utr_t *ptr, uint16_t hubaddr, uint16_t data2)
{
    uint16_t md, i;
    usb_hcdreg_t *driver;
    uint16_t devaddr, index;

    for (i = 1; i <= g_usb_shhub_info_data[ptr->ip][hubaddr].port_num; i++)
    {
        /* Now downport device search */
        devaddr = usb_hhub_get_cnn_devaddr(ptr, hubaddr, i);
        if (0 != devaddr)
        {
            /* HUB down port selective disconnect */
            usb_hhub_selective_detach(ptr, devaddr);
            for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
            {
                driver = &g_usb_hstd_device_drv[ptr->ip][md];
                if (devaddr == driver->devaddr)
                {
                    if (USB_NULL == driver->devdetach)   /* Chack Callback function */
                    {
                        while(1)
                        {
                            /* Error Stop */
                        }
                    }
                    (*driver->devdetach)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);
                    driver->rootport = USB_NOPORT; /* Root port */
                    driver->devaddr = USB_NODEVICE; /* Device devaddress */
                    driver->devstate = USB_DETACHED; /* Device state */
                }
            }
        }
    }

    g_usb_shhub_number[ptr->ip]--;
    index = usb_hhub_chk_tbl_indx2(ptr, hubaddr);

    /* Set pipe information */
    for (i = 1; i <= USB_MAXDEVADDR; i++)
    {
        g_usb_shhub_info_data[ptr->ip][i].up_addr = 0; /* Up-address clear */
        g_usb_shhub_info_data[ptr->ip][i].up_port_num = 0; /* Up-port num clear */
        g_usb_shhub_info_data[ptr->ip][i].port_num = 0; /* Port number clear */
        g_usb_shhub_info_data[ptr->ip][i].pipe_num = 0; /* Pipe number clear */
    }

    g_usb_shhub_down_port[ptr->ip][hubaddr] = 0;
    g_usb_shhub_remote[ptr->ip][hubaddr] = 0;
    g_usb_hhub_def_ep_tbl[ptr->ip][index + 1] = USB_NULL;
    g_usb_hhub_def_ep_tbl[ptr->ip][index + 3] = USB_NULL;
    g_usb_hhub_def_ep_tbl[ptr->ip][index + 4] = USB_NULL;
    g_usb_hhub_tmp_ep_tbl[ptr->ip][index + 1] = USB_NULL;
    g_usb_hhub_tmp_ep_tbl[ptr->ip][index + 3] = USB_NULL;
    g_usb_hhub_tmp_ep_tbl[ptr->ip][index + 4] = USB_NULL;

}
/******************************************************************************
 End of function usb_hhub_close
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_registration
 Description     : Registration Processing for HUB driver
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : usb_hcdreg_t *callback   : Pointer ot usb_hcdreg_t structure.
 Return value    : none
 ******************************************************************************/
void usb_hhub_registration (usb_utr_t *ptr, usb_hcdreg_t *callback)
{
    usb_hcdreg_t driver;

    /* Driver registration */
    if (USB_NULL == callback)
    {
        /* Target peripheral list */
        driver.p_tpl = (uint16_t*) &g_usb_hhub_tpl[0];

        /* Pipe Information Table Define address */
        driver.p_pipetbl = (uint16_t*) &g_usb_hhub_def_ep_tbl[ptr->ip];
    }
    else
    {
        /* Target peripheral list */
        driver.p_tpl = callback->p_tpl;

        /* Pipe Define Table address */
        driver.p_pipetbl = callback->p_pipetbl;
    }

    driver.ifclass = (uint16_t) USB_IFCLS_HUB; /* Interface Class */
    driver.classinit = &usb_hhub_initial; /* Driver init */
    driver.classcheck = &usb_hhub_check_class; /* Driver check */
    driver.devconfig = (usb_cb_t) &usb_hhub_open; /* Device configured */
    driver.devdetach = (usb_cb_t) &usb_hhub_close; /* Device detach */
    driver.devsuspend = &usb_hstd_dummy_function; /* Device suspend */
    driver.devresume = &usb_hstd_dummy_function; /* Device resume */

    usb_hstd_driver_registration(ptr, (usb_hcdreg_t *) &driver);
}
/******************************************************************************
 End of function usb_hhub_registration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_hub_information
 Description     : Read HUB-Descriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     hubaddr     : hub address
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : DONE/ERROR
 ******************************************************************************/
uint16_t usb_hhub_get_hub_information (usb_utr_t *ptr, uint16_t hubaddr, usb_cb_t complete)
{
    usb_er_t qerr;

