tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
    /* Request */
    g_usb_shhub_class_request[ptr->ip][0] = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_CLASS | USB_DEVICE;
    g_usb_shhub_class_request[ptr->ip][1] = USB_HUB_DESCRIPTOR;
    g_usb_shhub_class_request[ptr->ip][2] = 0;
    g_usb_shhub_class_request[ptr->ip][3] = 0x0047;
    g_usb_shhub_class_request[ptr->ip][4] = hubaddr; /* Device address */

    /* HUB Descriptor */
    g_usb_shhub_ctrl_mess[ptr->ip].keyword = USB_PIPE0;
    g_usb_shhub_ctrl_mess[ptr->ip].p_tranadr = (void*) &g_usb_hhub_descriptor[ptr->ip][0];
    g_usb_shhub_ctrl_mess[ptr->ip].tranlen = (uint32_t) g_usb_shhub_class_request[ptr->ip][3];
    g_usb_shhub_ctrl_mess[ptr->ip].p_setup = g_usb_shhub_class_request[ptr->ip];
    g_usb_shhub_ctrl_mess[ptr->ip].segment = USB_TRAN_END;
    g_usb_shhub_ctrl_mess[ptr->ip].complete = complete;

    g_usb_shhub_ctrl_mess[ptr->ip].ipp = ptr->ipp;
    g_usb_shhub_ctrl_mess[ptr->ip].ip = ptr->ip;

    /* Transfer start */
    qerr = usb_hstd_transfer_start(&g_usb_shhub_ctrl_mess[ptr->ip]);
    if (USB_QOVR == qerr)
    {
        return USB_HUB_QOVR;
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_hub_information
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_port_information
 Description     : Get the port information
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     hubaddr     : hub address
                 : uint16_t     port        : down port number
                 : usb_cb_t     complete    : Callback function
 Return value    : uint16_t     : DONE/ERROR
 ******************************************************************************/
uint16_t usb_hhub_get_port_information (usb_utr_t *ptr, uint16_t hubaddr, uint16_t port, usb_cb_t complete)
{
    usb_er_t qerr;

    /* Request */
    g_usb_shhub_class_request[ptr->ip][0] = USB_GET_STATUS | USB_DEV_TO_HOST | USB_CLASS | USB_OTHER;
    g_usb_shhub_class_request[ptr->ip][1] = 0;
    g_usb_shhub_class_request[ptr->ip][2] = port; /* Port number */
    g_usb_shhub_class_request[ptr->ip][3] = 4;
    g_usb_shhub_class_request[ptr->ip][4] = hubaddr; /* Device address */

    /* Port GetStatus */
    g_usb_shhub_ctrl_mess[ptr->ip].keyword = USB_PIPE0;
    g_usb_shhub_ctrl_mess[ptr->ip].p_tranadr = (void*) &g_usb_hhub_data[ptr->ip][hubaddr][0];
    g_usb_shhub_ctrl_mess[ptr->ip].tranlen = (uint32_t) g_usb_shhub_class_request[ptr->ip][3];
    g_usb_shhub_ctrl_mess[ptr->ip].p_setup = g_usb_shhub_class_request[ptr->ip];
    g_usb_shhub_ctrl_mess[ptr->ip].segment = USB_TRAN_END;
    g_usb_shhub_ctrl_mess[ptr->ip].complete = complete;

    g_usb_shhub_ctrl_mess[ptr->ip].ipp = ptr->ipp;
    g_usb_shhub_ctrl_mess[ptr->ip].ip = ptr->ip;

    /* Transfer start */
    qerr = usb_hstd_transfer_start(&g_usb_shhub_ctrl_mess[ptr->ip]);
    if (USB_QOVR == qerr)
    {
        return USB_HUB_QOVR;
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_port_information
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_task
 Description     : HUB task
 Arguments       : usb_vp_int_t stacd          : Start Code of Hub Task
 Return value    : none
 ******************************************************************************/
void usb_hhub_task (usb_vp_int_t stacd)
{
    usb_utr_t *mess;
    usb_er_t err;

    /* Receive message */
    err = USB_TRCV_MSG(USB_HUB_MBX, (usb_msg_t** )&mess, (usb_tm_t )0);
    if (USB_OK != err)
    {
        return;
    }

    switch (mess->msginfo)
    {
        case USB_MSG_CLS_CHECKREQUEST :

            /* USB HUB Class Enumeration */
            usb_hhub_enumeration((usb_clsinfo_t *) mess);
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )mess);
            if (USB_OK != err)
            {
                /* Release Memoryblock failure */
                USB_PRINTF0("### USB HUB Task rel_blk error\n");
            }
        break;

        case USB_MSG_CLS_INIT :

            /* Down port initialize */
            usb_hhub_init_down_port(mess, (uint16_t) 0, (usb_clsinfo_t *) mess);
        break;

            /* Enumeration waiting of other device */
        case USB_MSG_CLS_WAIT :
            mess->msginfo = USB_MSG_MGR_AORDETACH;
            err = USB_SND_MSG(USB_MGR_MBX, (usb_msg_t* )mess);
            if (USB_OK != err)
            {
                /* Send Message failure */
                USB_PRINTF0("### USB HUB enuwait snd_msg error\n");
            }
        break;

        case USB_MSG_HUB_EVENT :
            usb_hhub_event((usb_clsinfo_t *) mess);
        break;

        case USB_MSG_HUB_ATTACH :

            /* Hub Port attach */
            usb_hhub_port_attach((uint16_t) 0, (uint16_t) 0, (usb_clsinfo_t *) mess);
        break;

        case USB_MSG_HUB_RESET :

            /* Hub Reset */
            usb_hhub_port_reset(mess, (uint16_t) 0, (uint16_t) 0, (usb_clsinfo_t *) mess);
        break;

        default :
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )mess);
            if (USB_OK != err)
            {
                USB_PRINTF0("### USB HUB rel_blk error\n");
            }
        break;
    }
}
/******************************************************************************
 End of function usb_hhub_task
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_enumeration
 Description     : USB HUB Class Enumeration
 Arguments       : usb_clsinfo_t *ptr   : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_enumeration (usb_clsinfo_t *ptr)
{
    /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
    uint8_t pdata[32];
    uint16_t j;
#endif  /* USB_DEBUG_ON */
    uint16_t checkerr, retval;
    uint8_t string;
    uint16_t *table[8];

