tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
    checkerr = ptr->result;
    table[0] = (uint16_t*) g_p_usb_shhub_device_table[ptr->ip];
    table[1] = (uint16_t*) g_p_usb_shhub_config_table[ptr->ip];
    table[2] = (uint16_t*) g_p_usb_shhub_interface_table[ptr->ip];

    /* Manager Mode Change */
    switch (g_usb_shhub_class_seq[ptr->ip])
    {
        case USB_SEQ_0 :
            checkerr = USB_OK;

            /* Descriptor check */
            retval = usb_hhub_chk_config((uint16_t**) &table, (uint16_t) g_usb_shhub_spec[ptr->ip]);
            if (USB_ERROR == retval)
            {
                USB_PRINTF0("### Configuration descriptor error !\n");
                checkerr = USB_ERROR;
                break;
            }

            /* Interface Descriptor check */
            retval = usb_hhub_chk_interface((uint16_t**) &table, (uint16_t) g_usb_shhub_spec[ptr->ip]);
            if (USB_ERROR == retval)
            {
                USB_PRINTF0("### Interface descriptor error !\n");
                checkerr = USB_ERROR;
                break;
            }

            /* String descriptor */
            g_usb_shhub_process[ptr->ip] = USB_MSG_CLS_CHECKREQUEST;
            usb_hhub_get_string_descriptor1(ptr, g_usb_shhub_dev_addr[ptr->ip], (uint16_t) 15,
                    (usb_cb_t) &usb_hhub_class_request_complete);
        break;

        case USB_SEQ_1 :

            /* String descriptor check */
            retval = usb_hhub_get_string_descriptor1check(checkerr);
            if (USB_OK == retval)
            {
                string = g_p_usb_shhub_device_table[ptr->ip][15];

                /* String descriptor */
                g_usb_shhub_process[ptr->ip] = USB_MSG_CLS_CHECKREQUEST;
                usb_hhub_get_string_descriptor2(ptr, g_usb_shhub_dev_addr[ptr->ip], (uint16_t) string,
                        (usb_cb_t) &usb_hhub_class_request_complete);
            }
            else
            {
                /* If USB_ERROR, Go case 3 (checkerr==USB_ERROR) */
                g_usb_shhub_class_seq[ptr->ip] = USB_SEQ_2;

                /* Next sequence */
                usb_hhub_check_request(ptr, USB_ERROR);
                checkerr = USB_OK;
            }
        break;

        case USB_SEQ_2 :

            /* String descriptor check */
            retval = usb_hhub_get_string_descriptor_to_check(checkerr);
            if (USB_OK == retval)
            {
                /* Next sequence */
                usb_hhub_check_request(ptr, checkerr);
            }
        break;

        case USB_SEQ_3 :

            /* String descriptor check */
            if (USB_OK == checkerr)
            {
                if (g_usb_hstd_class_data[ptr->ip][0] < (uint8_t) ((32 * 2) + 2))
                {
                    g_usb_hstd_class_data[ptr->ip][0] = (uint8_t) (g_usb_hstd_class_data[ptr->ip][0] / 2);
                    g_usb_hstd_class_data[ptr->ip][0] = (uint8_t) (g_usb_hstd_class_data[ptr->ip][0] - 1);
                }
                else
                {
                    g_usb_hstd_class_data[ptr->ip][0] = (uint8_t) 32;
                }

                /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
                for (j = (uint16_t)0; j < g_usb_hstd_class_data[ptr->ip][0]; j++)
                {
                    pdata[j] = g_usb_hstd_class_data[ptr->ip][j * (uint16_t)2 + (uint16_t)2];
                }
                pdata[g_usb_hstd_class_data[ptr->ip][0]] = 0;
                USB_PRINTF1("    Product name : %s\n", pdata);
#endif  /* USB_DEBUG_ON */
            }
            else
            {
                USB_PRINTF0("*** Product name error\n");
                checkerr = USB_OK;
            }

            /* Get HUB descriptor */
            g_usb_shhub_process[ptr->ip] = USB_MSG_CLS_CHECKREQUEST;
            checkerr = usb_hhub_get_hub_information(ptr, g_usb_shhub_dev_addr[ptr->ip],
                    usb_hhub_class_request_complete);

            /* Submit overlap error */
            if (USB_HUB_QOVR == checkerr)
            {
                usb_hhub_specified_path_wait(ptr, (uint16_t) 10);
            }
        break;

        case USB_SEQ_4 :

            /* Get HUB descriptor Check */
            retval = usb_hhub_request_result(checkerr);
            if (USB_OK == retval)
            {
                usb_hhub_check_request(ptr, checkerr); /* Next sequence */
            }
        break;

        case USB_SEQ_5 :

            /* Get HUB descriptor Check */
            if (USB_OK == checkerr)
            {
                retval = usb_hhub_check_descriptor(g_usb_hhub_descriptor[ptr->ip], (uint16_t) USB_DT_HUBDESCRIPTOR);
                if (USB_ERROR == retval)
                {
                    USB_PRINTF0("### HUB descriptor error !\n");
                    checkerr = USB_ERROR;
                }
                else if (g_usb_hhub_descriptor[ptr->ip][2] > USB_HUBDOWNPORT)
                {
                    USB_PRINTF0("### HUB Port number over\n");
                    checkerr = USB_ERROR;
                }
                else
                {
                    USB_PRINTF1("    Attached %d port HUB\n", g_usb_hhub_descriptor[ptr->ip][2]);
                }
            }
            else
            {
                USB_PRINTF0("### HUB Descriptor over\n");
                checkerr = USB_ERROR;
            }

            /* Pipe Information table set */
            switch (g_usb_shhub_spec[ptr->ip])
            {
                case USB_FSHUB : /* Full Speed Hub */
                    if (USB_FSCONNECT == g_usb_shhub_speed[ptr->ip])
                    {
                        retval = usb_hhub_pipe_info(ptr, (uint8_t *) g_p_usb_shhub_interface_table[ptr->ip],
                                g_usb_shhub_index[ptr->ip], g_usb_shhub_speed[ptr->ip],
                                (uint16_t) g_p_usb_shhub_config_table[ptr->ip][2]);
                        if (USB_ERROR == retval)
                        {
                            USB_PRINTF0("### Device information error(HUB) !\n");
                            checkerr = USB_ERROR;
                        }
                    }
                    else
                    {
                        USB_PRINTF0("### HUB Descriptor speed error\n");
                        checkerr = USB_ERROR;
                    }
                break;

