tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
                case USB_HSHUBS : /* Hi Speed Hub(Single) */
                    if (USB_HSCONNECT == g_usb_shhub_speed[ptr->ip])
                    {
                        retval = usb_hhub_pipe_info(ptr, (uint8_t *) g_p_usb_shhub_interface_table[ptr->ip],
                                g_usb_shhub_index[ptr->ip], g_usb_shhub_speed[ptr->ip],
                                (uint16_t) g_p_usb_shhub_config_table[ptr->ip][2]);
                        if (USB_ERROR == retval)
                        {
                            USB_PRINTF0("### Device information error(HUB) !\n");
                            checkerr = USB_ERROR;
                        }
                    }
                    else
                    {
                        USB_PRINTF0("### HUB Descriptor speed error\n");
                        checkerr = USB_ERROR;
                    }
                break;

                case USB_HSHUBM : /* Hi Speed Hub(Multi) */
                    if (USB_HSCONNECT == g_usb_shhub_speed[ptr->ip])
                    {
                        /* Set pipe information */
                        retval = usb_hhub_pipe_info(ptr, (uint8_t *) g_p_usb_shhub_interface_table[ptr->ip],
                                g_usb_shhub_index[ptr->ip], g_usb_shhub_speed[ptr->ip],
                                (uint16_t) g_p_usb_shhub_config_table[ptr->ip][2]);
                        if (USB_ERROR == retval)
                        {
                            USB_PRINTF0("### Device information error(HUB) !\n");
                            checkerr = USB_ERROR;
                        }

                        /* Set pipe information */
                        retval = usb_hhub_pipe_info(ptr, (uint8_t *) g_p_usb_shhub_interface_table[ptr->ip],
                                g_usb_shhub_index[ptr->ip], g_usb_shhub_speed[ptr->ip],
                                (uint16_t) g_p_usb_shhub_config_table[ptr->ip][2]);
                        if (USB_ERROR == retval)
                        {
                            USB_PRINTF0("### Device information error(HUB) !\n");
                            checkerr = USB_ERROR;
                        }
                    }
                    else
                    {
                        USB_PRINTF0("### HUB Descriptor speed error\n");
                        checkerr = USB_ERROR;
                    }
                break;
                default :
                    checkerr = USB_ERROR;
                break;
            }

            /* Port number set */
            g_usb_shhub_info_data[ptr->ip][g_usb_shhub_dev_addr[ptr->ip]].port_num = g_usb_hhub_descriptor[ptr->ip][2];
            g_usb_shhub_process[ptr->ip] = USB_NULL;
            usb_hstd_return_enu_mgr((usb_utr_t *) ptr, checkerr); /* Return to MGR */
        break;

        default:
        break;
    }

    switch (checkerr)
    {
        /* Driver open */
        case USB_OK :
            g_usb_shhub_class_seq[ptr->ip]++;
        break;

            /* Submit overlap error */
        case USB_HUB_QOVR :
        break;

            /* Descriptor error */
        case USB_ERROR :
            USB_PRINTF0("### Enumeration is stoped(ClassCode-ERROR)\n");
            g_usb_shhub_process[ptr->ip] = USB_NULL;
            usb_hstd_return_enu_mgr((usb_utr_t *) ptr, USB_ERROR); /* Return to MGR */
        break;

        default :
            g_usb_shhub_process[ptr->ip] = USB_NULL;
            usb_hstd_return_enu_mgr((usb_utr_t *) ptr, USB_ERROR); /* Return to MGR */
        break;
    }
}
/******************************************************************************
 End of function usb_hhub_enumeration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_init_down_port
 Description     : Down port initialized
 Arguments       : usb_utr_t        *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t         hubaddr : Hub address
                 : usb_clsinfo_t    *mess   : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_init_down_port (usb_utr_t *ptr, uint16_t hubaddr, usb_clsinfo_t *mess)
{
    usb_er_t err;
    uint16_t retval;

    hubaddr = g_usb_shhub_hub_addr[ptr->ip];
    retval = USB_OK;

    if (USB_MSG_CLS_INIT != g_usb_shhub_process[ptr->ip]) /* Check Hub Process */
    {
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### HUB snd_msg error\n"); /* Send Message failure */
        }
    }
    else
    {
        switch (g_usb_shhub_init_seq[ptr->ip])
        {
            case USB_SEQ_0 : /* HUB port power */
                hubaddr = mess->keyword;
                g_usb_shhub_hub_addr[ptr->ip] = hubaddr;

                usb_hhub_device_descrip_info(ptr);
                usb_hhub_config_descrip_info(ptr);
                USB_PRINTF0("\nHHHHHHHHHHHHHHHHHHHHHHHHH\n");
                USB_PRINTF0("         USB HOST        \n");
                USB_PRINTF0("      HUB CLASS DEMO     \n");
                USB_PRINTF0("HHHHHHHHHHHHHHHHHHHHHHHHH\n\n");
                g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_1; /* Next Sequence */
                g_usb_shhub_init_port[ptr->ip] = USB_HUB_P1;
                usb_hhub_specified_path(mess); /* Next Process Selector */
            break;

            case USB_SEQ_1 : /* Request */
                retval = usb_hhub_port_set_feature(ptr, hubaddr, g_usb_shhub_init_port[ptr->ip],
                        (uint16_t) USB_HUB_PORT_POWER, usb_hhub_class_request_complete); /* SetFeature request */
                if (USB_HUB_QOVR == retval) /* Submit overlap error */
                {
                    usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                }
                else
                {
                    g_usb_shhub_init_port[ptr->ip]++; /* Next Port */
                    g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_2; /* Next Sequence */
                }
            break;

            case USB_SEQ_2 : /* Request Result Check */
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    if (g_usb_shhub_init_port[ptr->ip] > g_usb_shhub_info_data[ptr->ip][hubaddr].port_num)
                    {
                        g_usb_shhub_init_port[ptr->ip] = USB_HUB_P1; /* Port Clear */
                        g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_3; /* Next Sequence */
                        usb_hhub_specified_path(mess); /* Next Process Selector */
                    }
                    else
                    {
                        g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_1; /* Loop Sequence */
                        usb_hhub_specified_path(mess); /* Next Process Selector */
                    }
                }
            break;

            case USB_SEQ_3 : /* HUB downport initialize */
                retval = usb_hhub_port_clr_feature(ptr, hubaddr, g_usb_shhub_init_port[ptr->ip],
                        (uint16_t) USB_HUB_C_PORT_CONNECTION, usb_hhub_class_request_complete); /* Request */
                if (USB_HUB_QOVR == retval) /* Submit overlap error */
                {
                    usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                }
                else
                {
                    g_usb_shhub_init_port[ptr->ip]++; /* Next Port */
                    g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_4; /* Next Sequence */
                }
            break;

                /* Request Result Check */
            case USB_SEQ_4 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    if (g_usb_shhub_init_port[ptr->ip] > g_usb_shhub_info_data[ptr->ip][hubaddr].port_num)
                    {
                        g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_0; /* Sequence Clear */
                        g_usb_shhub_init_port[ptr->ip] = USB_HUB_P1; /* Port Clear */
                        g_usb_shhub_info[ptr->ip] = USB_MSG_CLS_INIT;
                        g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_EVENT; /* Next Attach Process */
                        usb_hhub_specified_path(mess); /* Next Process Selector */
                    }
                    else
                    {
                        g_usb_shhub_init_seq[ptr->ip] = USB_SEQ_3; /* Loop Sequence */
                        usb_hhub_specified_path(mess); /* Next Process Selector */
                    }
                }
            break;

            default :
                retval = USB_ERROR;
            break;
        }

