tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
                /* Get Port Number */
                rootport = usb_hstd_get_rootport(ptr, (uint16_t) (hubaddr << USB_DEVADDRBIT));
                if ((USB_CONFIGURED == g_usb_hstd_mgr_mode[ptr->ip][rootport])
                        || (USB_DEFAULT != g_usb_hstd_mgr_mode[ptr->ip][rootport]))
                {
                    /* HUB downport status */
                    g_usb_shhub_down_port[ptr->ip][hubaddr] |= USB_BITSET(portnum);
                    g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_0;
                    g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_EVENT;
                    usb_hhub_specified_path(mess);
                }
                else
                {
                    g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_2;
                    usb_hhub_specified_path_wait(mess, 3u);
                }
            break;

            case USB_SEQ_3 :
                g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_4;
                g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_RESET;
                usb_hhub_specified_path(mess); /* Next Process Selector */
            break;

            case USB_SEQ_4 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    /* Hub Port Set Feature Request */
                    retval = usb_hhub_port_set_feature(ptr, hubaddr, portnum, USB_HUB_PORT_SUSPEND,
                            usb_hhub_class_request_complete);

                    /* Submit overlap error */
                    if (USB_HUB_QOVR == retval)
                    {
                        usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                    }
                    else
                    {
                        g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_5;
                    }
                }
            break;

            case USB_SEQ_5 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    usb_hhub_port_detach(ptr, hubaddr, portnum);
                    g_usb_shhub_info_data[ptr->ip][devaddr].up_addr = 0; /* Up-hubaddr clear */
                    g_usb_shhub_info_data[ptr->ip][devaddr].up_port_num = 0; /* Up-hubport clear */
                    g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_0;
                    g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_EVENT;
                    usb_hhub_specified_path(mess);
                }
            break;

            default :
                g_usb_shhub_attach_seq[ptr->ip] = USB_SEQ_0;
                g_usb_shhub_process[ptr->ip] = USB_NULL;
                g_usb_shhub_info[ptr->ip] = USB_NULL;
            break;
        }

        err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### USB HostHubClass rel_blk error\n");
        }
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_port_attach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_event
 Description     : USB Hub Event process.
 Arguments       : usb_clsinfo_t *mess    : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_event (usb_clsinfo_t *mess)
{
    usb_er_t err;
    uint16_t hubaddr, devaddr, retval;
    usb_utr_t *ptr;
    uint32_t port_status;
    uint16_t next_port_check = USB_FALSE;
    uint16_t port_clr_feature_type;

    ptr = (usb_utr_t *) mess;
    hubaddr = g_usb_shhub_hub_addr[ptr->ip];

    if (USB_MSG_HUB_EVENT != g_usb_shhub_process[ptr->ip])
    {
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### HUB snd_msg error\n");
        }
    }
    else
    {
        switch (g_usb_shhub_event_seq[ptr->ip])
        {
            case USB_SEQ_0 : /* Request */
                if (USB_MSG_HUB_SUBMITRESULT == g_usb_shhub_info[ptr->ip]) /* Event Check */
                {
                    /* Hub and Port Status Change Bitmap(b0:Hub,b1:DownPort1change detected,b2:DownPort2,...) */
                    if (0 != (g_usb_hhub_data[ptr->ip][hubaddr][0] & USB_BITSET(g_usb_shhub_event_port[ptr->ip])))
                    {
                        USB_PRINTF1(" *** HUB port %d \t",g_usb_shhub_event_port[ptr->ip]);

                        /* GetStatus request */
                        retval = usb_hhub_get_port_information(ptr, hubaddr, g_usb_shhub_event_port[ptr->ip],
                                usb_hhub_class_request_complete);
                        if (USB_HUB_QOVR == retval) /* Submit overlap error */
                        {
                            usb_hhub_specified_path_wait(mess, (uint16_t) 10); /* Retry */
                        }
                        else
                        {
                            g_usb_shhub_event_seq[ptr->ip] = USB_SEQ_1;
                        }
                    }
                    else
                    {
                        /* Port check end */
                        next_port_check = USB_TRUE;
                    }
                }
                else
                /*            if (USB_MSG_CLS_INIT == g_usb_shhub_info[ptr->ip])    *//* Event Check */
                { /* USB_MSG_HUB_INIT */
                    USB_PRINTF2(" *** address %d downport %d \t", hubaddr, g_usb_shhub_event_port[ptr->ip]);

                    /* GetStatus request */
                    retval = usb_hhub_get_port_information(ptr, hubaddr, g_usb_shhub_event_port[ptr->ip],
                            usb_hhub_class_request_complete);
                    if (USB_HUB_QOVR == retval) /* Submit overlap error */
                    {
                        usb_hhub_specified_path_wait(mess, (uint16_t) 10); /* Retry */
                    }
                    else
                    {
                        g_usb_shhub_event_seq[ptr->ip] = USB_SEQ_3;
                    }
                }
            break;

            case USB_SEQ_1 : /* Request Result Check & Request */
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    port_status = (uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][0];
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][1] << 8);
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][2] << 16);
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][3] << 24);
                    USB_PRINTF2(" [port/status] : %d, 0x%08x\n", g_usb_shhub_event_port[ptr->ip], port_status);

