tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
        err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### USB HostHubClass rel_blk error\n");
        }
    }
}
/******************************************************************************
 End of function usb_hhub_event
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_port_reset
 Description     : HUB down port USB-reset request
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
                 : uint16_t portnum     : down port number
                 : usb_clsinfo_t *mess  : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_port_reset (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess)
{
    usb_er_t err;
    uint16_t retval;
    uint32_t port_status;

    hubaddr = g_usb_shhub_hub_addr[ptr->ip];
    portnum = g_usb_shhub_event_port[ptr->ip];

    if (USB_MSG_HUB_RESET != g_usb_shhub_process[ptr->ip])
    {
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### HUB snd_msg error\n");
        }
    }
    else
    {
        switch (g_usb_shhub_reset_seq[ptr->ip])
        {
            case USB_SEQ_0 :

                /* Hub port SetFeature */
                usb_cpu_delay_xms((uint16_t) 100);
                retval = usb_hhub_port_set_feature(ptr, hubaddr, portnum, (uint16_t) USB_HUB_PORT_RESET,
                        usb_hhub_class_request_complete);

                /* Submit overlap error */
                if (USB_HUB_QOVR == retval)
                {
                    usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                }
                else
                {
                    g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_1;
                }
            break;

            case USB_SEQ_1 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    usb_cpu_delay_xms((uint16_t) 60);

                    /* Get Status */
                    retval = usb_hhub_get_port_information(ptr, hubaddr, portnum, usb_hhub_class_request_complete);

                    /* Submit overlap error */
                    if (USB_HUB_QOVR == retval)
                    {
                        usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                    }
                    else
                    {
                        g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_2;
                    }
                }
            break;

            case USB_SEQ_2 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    port_status = (uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][0];
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][1] << 8);
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][2] << 16);
                    port_status |= ((uint32_t) g_usb_hhub_data[ptr->ip][hubaddr][3] << 24);

                    /* Check Reset Change(C_PORT_RESET) */
                    if (USB_BIT_C_PORT_RESET != (port_status & USB_BIT_C_PORT_RESET))
                    {
                        g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_0;
                        usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                    }
                    else
                    {
                        /* Hub port ClearFeature */
                        usb_cpu_delay_xms((uint16_t) 20);

                        retval = usb_hhub_port_clr_feature(ptr, hubaddr, portnum, (uint16_t) USB_HUB_C_PORT_RESET,
                                usb_hhub_class_request_complete);

                        /* Submit overlap error */
                        if (USB_HUB_QOVR == retval)
                        {
                            usb_hhub_specified_path_wait(mess, (uint16_t) 10);
                        }
                        else
                        {
                            g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_3;
                        }
                    }
                }
            break;

            case USB_SEQ_3 :
                retval = usb_hhub_request_result(mess->result);
                if (USB_OK == retval)
                {
                    g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_0;
                    g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_ATTACH;
                    usb_hhub_specified_path(mess);
                }
            break;

            default :
                g_usb_shhub_reset_seq[ptr->ip] = USB_SEQ_0;
                g_usb_shhub_process[ptr->ip] = USB_NULL;
            break;
        }

        err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### USB HostHubClass rel_blk error\n");
        }
    }
}
/******************************************************************************
 End of function usb_hhub_port_reset
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_check_class
 Description     : HUB Class driver check
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t **table : Descriptor, etc
 Return value    : none
 ******************************************************************************/
static void usb_hhub_check_class (usb_utr_t *ptr, uint16_t **table)
{
    usb_clsinfo_t *p_blf;
    usb_clsinfo_t *cp;
    usb_er_t err;

    g_p_usb_shhub_device_table[ptr->ip] = (uint8_t*) (table[0]);
    g_p_usb_shhub_config_table[ptr->ip] = (uint8_t*) (table[1]);
    g_p_usb_shhub_interface_table[ptr->ip] = (uint8_t*) (table[2]);
    *table[3] = USB_OK;
    g_usb_shhub_spec[ptr->ip] = *table[4];
    g_usb_shhub_root[ptr->ip] = *table[5];
    g_usb_shhub_speed[ptr->ip] = *table[6];
    g_usb_shhub_dev_addr[ptr->ip] = *table[7];
    g_usb_shhub_index[ptr->ip] = usb_hhub_chk_tbl_indx1(ptr, g_usb_shhub_dev_addr[ptr->ip]);

    g_usb_shhub_class_seq[ptr->ip] = 0;

