tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = USB_MSG_CLS_CHECKREQUEST;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Enumeration wait TaskID change */
        usb_hstd_enu_wait(ptr, (uint8_t) USB_HUB_TSK);

        /* Class check of enumeration sequence move to class function */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )cp);
        if (USB_OK != err)
        {
            /* Send Message failure */
            USB_PRINTF1("Host HUB snd_msg error %x\n", err);
        }
    }
    else
    {
        /* Send Message failure */
        while (1)
        {
            /* Non */
        }
    }
}
/******************************************************************************
 End of function usb_hhub_check_class
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_trans_start
 Description     : HUB sys data transfer / control transfer
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
                 : uint32_t size        : Data Transfer size
                 : uint8_t  *table      : Receive Data area
                 : usb_cb_t complete    : Callback function
 Return value    : none
 ******************************************************************************/
static void usb_hhub_trans_start (usb_utr_t *ptr, uint16_t hubaddr, uint32_t size, uint8_t *table, usb_cb_t complete)
{
    usb_er_t err;

    /* Transfer structure setting */
    g_usb_shhub_data_mess[ptr->ip][hubaddr].keyword = g_usb_shhub_info_data[ptr->ip][hubaddr].pipe_num;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].p_tranadr = table;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].tranlen = size;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].p_setup = 0;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].status = USB_DATA_WAIT;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].complete = complete;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].segment = USB_TRAN_END;

    g_usb_shhub_data_mess[ptr->ip][hubaddr].ipp = ptr->ipp;
    g_usb_shhub_data_mess[ptr->ip][hubaddr].ip = ptr->ip;

    /* Transfer start */
    err = usb_hstd_transfer_start(&g_usb_shhub_data_mess[ptr->ip][hubaddr]);
    if (USB_OK != err)
    {
        /* Send Message failure */
        USB_PRINTF1("### usb_hhub_trans_start error (%ld)\n", err);
    }
}
/******************************************************************************
 End of function usb_hhub_trans_start
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_port_set_feature
 Description     : SetFeature request
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
                 : uint16_t port        : down port number
                 : uint16_t command     : request command
 Return value    : uint16_t             : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_port_set_feature (usb_utr_t *ptr, uint16_t hubaddr, uint16_t port, uint16_t command,
        usb_cb_t complete)
{
    usb_er_t qerr;

    /* Request */
    g_usb_shhub_class_request[ptr->ip][0] = USB_SET_FEATURE | USB_HOST_TO_DEV | USB_CLASS | USB_OTHER;
    g_usb_shhub_class_request[ptr->ip][1] = command;
    g_usb_shhub_class_request[ptr->ip][2] = port; /* Port number */
    g_usb_shhub_class_request[ptr->ip][3] = 0;
    g_usb_shhub_class_request[ptr->ip][4] = hubaddr; /* Device address */

    /* Port SetFeature */
    g_usb_shhub_ctrl_mess[ptr->ip].keyword = USB_PIPE0;
    g_usb_shhub_ctrl_mess[ptr->ip].p_tranadr = (void*) &g_usb_hhub_data[ptr->ip][hubaddr][0];
    g_usb_shhub_ctrl_mess[ptr->ip].tranlen = (uint32_t) g_usb_shhub_class_request[ptr->ip][3];
    g_usb_shhub_ctrl_mess[ptr->ip].p_setup = g_usb_shhub_class_request[ptr->ip];
    g_usb_shhub_ctrl_mess[ptr->ip].segment = USB_TRAN_END;
    g_usb_shhub_ctrl_mess[ptr->ip].complete = complete;

    g_usb_shhub_ctrl_mess[ptr->ip].ipp = ptr->ipp;
    g_usb_shhub_ctrl_mess[ptr->ip].ip = ptr->ip;

    /* Transfer start */
    qerr = usb_hstd_transfer_start(&g_usb_shhub_ctrl_mess[ptr->ip]);
    if (USB_QOVR == qerr)
    {
        return USB_HUB_QOVR;
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_port_set_feature
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_port_clr_feature
 Description     : ClearFeature request
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
                 : uint16_t port        : down port number
                 : uint16_t command     : request command
 Return value    : uint16_t             : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_port_clr_feature (usb_utr_t *ptr, uint16_t hubaddr, uint16_t port, uint16_t command,
        usb_cb_t complete)
{
    usb_er_t qerr;

    /* Request */
    g_usb_shhub_class_request[ptr->ip][0] = USB_CLEAR_FEATURE | USB_HOST_TO_DEV | USB_CLASS | USB_OTHER;
    g_usb_shhub_class_request[ptr->ip][1] = command;
    g_usb_shhub_class_request[ptr->ip][2] = port; /* Port number */
    g_usb_shhub_class_request[ptr->ip][3] = 0;
    g_usb_shhub_class_request[ptr->ip][4] = hubaddr; /* Device address */

    /* Port ClearFeature */
    g_usb_shhub_ctrl_mess[ptr->ip].keyword = USB_PIPE0;
    g_usb_shhub_ctrl_mess[ptr->ip].p_tranadr = (void*) &g_usb_hhub_data[ptr->ip][hubaddr][0];
    g_usb_shhub_ctrl_mess[ptr->ip].tranlen = (uint32_t) g_usb_shhub_class_request[ptr->ip][3];
    g_usb_shhub_ctrl_mess[ptr->ip].p_setup = g_usb_shhub_class_request[ptr->ip];
    g_usb_shhub_ctrl_mess[ptr->ip].segment = USB_TRAN_END;
    g_usb_shhub_ctrl_mess[ptr->ip].complete = complete;

