tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
    g_usb_shhub_ctrl_mess[ptr->ip].ipp = ptr->ipp;
    g_usb_shhub_ctrl_mess[ptr->ip].ip = ptr->ip;

    /* Transfer start */
    qerr = usb_hstd_transfer_start(&g_usb_shhub_ctrl_mess[ptr->ip]);
    if (USB_QOVR == qerr)
    {
        return USB_HUB_QOVR;
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_port_clr_feature
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_request_result
 Description     : Hub Request Result Check
 Arguments       : uint16_t errcheck         : hub result
 Return value    : uint16_t                  : USB_OK/USB_ERROR
 ******************************************************************************/
static uint16_t usb_hhub_request_result (uint16_t errcheck)
{
    if (USB_DATA_TMO == errcheck)
    {
        USB_PRINTF0("*** HUB Request Timeout error !\n");
        return USB_ERROR;
    }
    else if (USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** HUB Request STALL !\n");
        return USB_ERROR;
    }
    else if (USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** HUB Request error !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_request_result
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_trans_complete
 Description     : Recieve complete Hub and Port Status Change Bitmap
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used.
                 : uint16_t     data2   : Not used.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_trans_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_er_t err;
    uint16_t pipenum, hubaddr;
    usb_utr_t *ptr;

    ptr = (usb_utr_t *) mess;
    pipenum = mess->keyword;
    hubaddr = usb_hhub_get_hubaddr(ptr, pipenum);
    g_usb_shhub_hub_addr[ptr->ip] = hubaddr;

    if ((USB_MSG_HUB_SUBMITRESULT != g_usb_shhub_process[ptr->ip]) && (USB_NULL != g_usb_shhub_process[ptr->ip]))
    {
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )mess);
        if (USB_OK != err)
        {
            /* Send Message failure */
            USB_PRINTF0("### HUB snd_msg error\n");
        }
    }
    else
    {
        g_usb_shhub_process[ptr->ip] = USB_NULL;

        switch (mess->status)
        {
            case USB_DATA_SHT :

                /*USB_PRINTF1("*** receive short(pipe %d : HUB) !\n", pipenum);*/
                /* Continue */
                /* Direction is in then data receive end */
            case USB_DATA_OK :
                if ((USB_DEFAULT == g_usb_hstd_mgr_mode[ptr->ip][0])
                        || (USB_DEFAULT == g_usb_hstd_mgr_mode[ptr->ip][1]))
                {
                    err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )mess);
                    if (USB_OK != err)
                    {
                        USB_PRINTF0("### HUB task snd_msg error\n");
                    }
                }
                else
                {
                    /* HUB port connection */
                    g_usb_shhub_info[ptr->ip] = USB_MSG_HUB_SUBMITRESULT;
                    g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_EVENT;
                    usb_hhub_specified_path(mess);
                }
            break;
            case USB_DATA_STALL :
                USB_PRINTF0("*** Data Read error. (STALL) !\n");

                /* CLEAR_FEATURE */
                usb_hstd_clr_stall(ptr, pipenum, (usb_cb_t) &usb_hstd_dummy_function);
            break;
            case USB_DATA_OVR :
                USB_PRINTF0("### receiver over. !\n");
            break;
            case USB_DATA_STOP :
                USB_PRINTF0("### receiver stop. !\n");
            break;
            default :
                USB_PRINTF0("### HUB Class Data Read error !\n");
            break;
        }
    }
}
/******************************************************************************
 End of function usb_hhub_trans_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_class_request_complete
 Description     : Hub class check result
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used.
                 : uint16_t     data2   : Not used.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_class_request_complete (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = g_usb_shhub_process[ptr->ip];
        cp->keyword = ptr->keyword;
        cp->result = ptr->status;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Send message */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            /* Send message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### CheckResult function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### CheckResult function pget_blk error\n");
        while (1)
        {
            /* Non */
        }
    }
}
/******************************************************************************
 End of function usb_hhub_class_request_complete
 ******************************************************************************/

