tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_initial
 Description     : Global memory initialized
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used.
                 : uint16_t     data2   : Not used.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_initial (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    uint16_t i;

    for (i = 0u; i < (USB_MAXDEVADDR + 1u); i++)
    {
        g_usb_shhub_info_data[ptr->ip][i].up_addr = 0; /* Up-address clear */
        g_usb_shhub_info_data[ptr->ip][i].up_port_num = 0; /* Up-port num clear */
        g_usb_shhub_info_data[ptr->ip][i].port_num = 0; /* Port number clear */
        g_usb_shhub_info_data[ptr->ip][i].pipe_num = 0; /* Pipe number clear */
    }
    g_usb_shhub_number[ptr->ip] = 0;
}
/******************************************************************************
 End of function usb_hhub_initial
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_pipe_info
 Description     : Set pipe information
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint8_t      *table  : Interface Descriptor
                 : uint16_t     offset  : DEF_EP table offset
                 : uint16_t     speed   : device speed
                 : uint16_t     length  : Interface Descriptor length
 Return value    : uint16_t             : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t offset, uint16_t speed, uint16_t length)
{
    uint16_t ofdsc;
    uint16_t retval;

    /* Check Descriptor */
    if (USB_DT_INTERFACE != table[1])
    {
        /* Configuration Descriptor */
        USB_PRINTF0("### Interface descriptor error (HUB).\n");
        return USB_ERROR;
    }

    /* Check Endpoint Descriptor */
    ofdsc = table[0];
    while (ofdsc < (length - table[0]))
    {
        /* Search within Interface */
        switch (table[ofdsc + 1])
        {
            /* Device Descriptor */
            case USB_DT_DEVICE :

                /* Configuration Descriptor */
            case USB_DT_CONFIGURATION :

                /* String Descriptor */
            case USB_DT_STRING :

                /* Interface Descriptor */
            case USB_DT_INTERFACE :
                USB_PRINTF0("### Endpoint Descriptor error(HUB).\n");
                return USB_ERROR;
            break;

                /* Endpoint Descriptor */
            case USB_DT_ENDPOINT :

                /* Interrupt Endpoint */
                if (USB_EP_INT == (table[ofdsc + 3] & USB_EP_TRNSMASK))
                {
                    retval = usb_hstd_chk_pipe_info(speed, &g_usb_hhub_tmp_ep_tbl[ptr->ip][offset], &table[ofdsc]);
                    if (USB_DIR_H_IN == retval)
                    {
                        return USB_OK;
                    }
                    else
                    {
                        USB_PRINTF0("### Endpoint Descriptor error(HUB).\n");
                    }
                }
                ofdsc += table[ofdsc];
            break;

                /* Device Qualifier Descriptor */
            case USB_DT_DEVICE_QUALIFIER :

                /* Other Speed Configuration */
            case USB_DT_OTHER_SPEED_CONF :

                /* Interface Power Descriptor */
            case USB_DT_INTERFACE_POWER :
                USB_PRINTF0("### Endpoint Descriptor error(HUB).\n");
                return USB_ERROR;
            break;

                /* Another Descriptor */
            default :
                ofdsc += table[ofdsc];
            break;
        }
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hhub_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_check_request
 Description     : Class check request
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     result  : Check result value
 Return value    : none
 ******************************************************************************/
static void usb_hhub_check_request (usb_utr_t *ptr, uint16_t result)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = USB_MSG_CLS_CHECKREQUEST;
        cp->result = result;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Send message */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            /* Send message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### CheckRequest function snd_msg error\n");
        }
    }
    else
    {
        /* Get memoryblock failure */
        USB_PRINTF0("### CheckRequest function pget_blk error\n");
        while (1)
        {
            /* Non */
        }
    }

}
/******************************************************************************
 End of function usb_hhub_check_request
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_check_descriptor
 Description     : check descriptor for the debugging
 Arguments       : uint8_t *table            : Pointer to the descriptor area
                 : uint16_t spec             : Descriptor valule
 Return value    : none
 ******************************************************************************/
uint16_t usb_hhub_check_descriptor (uint8_t *table, uint16_t spec)
{
    /* Condition compilation by the difference of useful function */
#ifdef USB_DEBUG_ON
    /* Check Descriptor */
    if (table[1] == spec)
    {
        switch (table[1])
        {
            /* Device Descriptor */
            case USB_DT_DEVICE:
            USB_PRINTF0("  Device Descriptor.\n");
            break;
            /* Configuration Descriptor */
            case USB_DT_CONFIGURATION:
            USB_PRINTF0("  Configuration Descriptor.\n");
            break;
            /* String Descriptor */
            case USB_DT_STRING:
            USB_PRINTF0("  String Descriptor.\n");
            break;
            /* Interface Descriptor */
            case USB_DT_INTERFACE:
            USB_PRINTF0("  Interface Descriptor.\n");
            break;
            /* Endpoint Descriptor */
            case USB_DT_ENDPOINT:
            USB_PRINTF0("  Endpoint Descriptor.\n");
            break;
            /* Device Qualifier Descriptor */
            case USB_DT_DEVICE_QUALIFIER:
            USB_PRINTF0("  Device Qualifier Descriptor.\n");
            break;
            /* Other Speed Configuration Descriptor */
            case USB_DT_OTHER_SPEED_CONF:
            USB_PRINTF0("  Other Speed Configuration Descriptor.\n");
            break;
            /* Interface Power Descriptor */
            case USB_DT_INTERFACE_POWER:
            USB_PRINTF0("  Interface Power Descriptor.\n");
            break;
            /* HUB Descriptor */
            case USB_DT_HUBDESCRIPTOR:
            USB_PRINTF0("  HUB Descriptor.\n");
            break;
            /* Not Descriptor */
            default:
            USB_PRINTF0("### Descriptor error (Not Standard Descriptor).\n");
            return USB_ERROR;
            break;
        }
        return USB_OK;
    }
    else
    {
        switch (table[1])
        {
            /* Device Descriptor */
            case USB_DT_DEVICE:
            USB_PRINTF0("### Descriptor error (Device Descriptor).\n");
            break;
            /* Configuration Descriptor */
            case USB_DT_CONFIGURATION:
            USB_PRINTF0("### Descriptor error (Configuration Descriptor).\n");
            break;
            /* String Descriptor */
            case USB_DT_STRING:
            USB_PRINTF0("### Descriptor error (String Descriptor).\n");
            break;
            /* Interface Descriptor ? */
            case USB_DT_INTERFACE:
            USB_PRINTF0("### Descriptor error (Interface Descriptor).\n");
            break;
            /* Endpoint Descriptor */
            case USB_DT_ENDPOINT:
            USB_PRINTF0("### Descriptor error (Endpoint Descriptor).\n");
            break;
            /* Device Qualifier Descriptor */
            case USB_DT_DEVICE_QUALIFIER:
            USB_PRINTF0("### Descriptor error (Device Qualifier Descriptor).\n");
            break;
            /* Other Speed Configuration Descriptor */
            case USB_DT_OTHER_SPEED_CONF:
            USB_PRINTF0("### Descriptor error (Other Speed Configuration Descriptor).\n");
            break;
            /* Interface Power Descriptor */
            case USB_DT_INTERFACE_POWER:
            USB_PRINTF0("### Descriptor error (Interface Power Descriptor).\n");
            break;
            /* Not Descriptor */
            default:
            USB_PRINTF0("### Descriptor error (Not Standard Descriptor).\n");
            break;
        }
        return USB_ERROR;
    }
#else   /* Not USB_DEBUG_ON */
    return USB_OK;

#endif  /* USB_DEBUG_ON */
}
/******************************************************************************
 End of function usb_hhub_check_descriptor
 ******************************************************************************/

