tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_chk_config
 Description     : Configuration Descriptor check
 Arguments       : uint16_t **table          : Pointer to Configuration Descriptor area
                 : uint16_t spec             : HUB specification
 Return value    : uint16_t                  : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_chk_config (uint16_t **table, uint16_t spec)
{
    uint8_t *descriptor_table;
    uint16_t ofset;

    descriptor_table = (uint8_t*) (table[1]);

    /* Descriptor check */
    ofset = usb_hhub_check_descriptor(descriptor_table, (uint16_t) USB_DT_CONFIGURATION);
    if (USB_ERROR == ofset)
    {
        USB_PRINTF0("### Configuration descriptor error !\n");
        return USB_ERROR;
    }

    /* Check interface number */
    switch (spec)
    {
        case USB_FSHUB : /* Full Speed Hub */
            if (USB_HUB_INTNUMFS != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBS : /* Hi Speed Hub(Multi) */
            if (USB_HUB_INTNUMHSS != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBM : /* Hi Speed Hub(Single) */
            if (USB_HUB_INTNUMHSM != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        default :
            return USB_ERROR;
        break;
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_chk_config
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_chk_interface
 Description     : Interface Descriptor check
 Arguments       : uint16_t **table          : Pointer to Interface Descriptor area
                 : uint16_t spec             : HUB specification
 Return value    : uint16_t                  : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_chk_interface (uint16_t **table, uint16_t spec)
{
    uint8_t *descriptor_Table;
    uint16_t ofset;

    descriptor_Table = (uint8_t*) (table[2]);

    /* Descriptor check */
    ofset = usb_hhub_check_descriptor(descriptor_Table, (uint16_t) USB_DT_INTERFACE);
    if (USB_ERROR == ofset)
    {
        USB_PRINTF0("### Interface descriptor error !\n");
        return USB_ERROR;
    }

    /* Check interface class */
    if (USB_IFCLS_HUB != descriptor_Table[5])
    {
        USB_PRINTF0("### HUB interface descriptor error !\n");
        return USB_ERROR;
    }

    /* Check interface number */
    switch (spec)
    {
        case USB_FSHUB : /* Full Speed Hub */
            if ((USB_HUB_INTNUMFS - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBS : /* Hi Speed Hub(Single) */
            if ((USB_HUB_INTNUMHSS - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBM : /* Hi Speed Hub(Multi) */
            if ((USB_HUB_INTNUMHSM - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        default :
            return USB_ERROR;
        break;
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_chk_interface
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_chk_tbl_indx1
 Description     : table index search
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
 Return value    : uint16_t             : table index
 ******************************************************************************/
static uint16_t usb_hhub_chk_tbl_indx1 (usb_utr_t *ptr, uint16_t hubaddr)
{
    uint16_t pipecheck[USB_MAX_PIPE_NO];
    uint16_t i;

    for (i = 0; i < USB_MAX_PIPE_NO; i++)
    {
        /* Check table clear */
        pipecheck[i] = 0;
    }

    for (i = 0; i < (USB_MAXDEVADDR + 1u); i++)
    {
        /* Used pipe number set */
        if (0 != g_usb_shhub_info_data[ptr->ip][i].pipe_num)
        {
            pipecheck[g_usb_shhub_info_data[ptr->ip][i].pipe_num - 1] = 1;
        }
    }

    for (i = USB_MAX_PIPE_NO; 0 != i; i--)
    {
        if (0 == pipecheck[i - 1])
        {
            return (uint16_t) ((USB_MAX_PIPE_NO - i) * USB_EPL);
        }
    }
    return (USB_ERROR);
}
/******************************************************************************
 End of function usb_hhub_chk_tbl_indx1
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_chk_tbl_indx2
 Description     : table index search
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : hub address
 Return value    : uint16_t             : table index
 ******************************************************************************/
static uint16_t usb_hhub_chk_tbl_indx2 (usb_utr_t *ptr, uint16_t hubaddr)
{
    /* Search table index */
    switch (g_usb_shhub_info_data[ptr->ip][hubaddr].pipe_num)
    {
        case USB_PIPE9 :
            return (uint16_t) (0u * USB_EPL);
        break;
        case USB_PIPE8 :
            return (uint16_t) (1u * USB_EPL);
        break;
        case USB_PIPE7 :
            return (uint16_t) (2u * USB_EPL);
        break;
        case USB_PIPE6 :
            return (uint16_t) (3u * USB_EPL);
        break;
        default :
        break;
    }

    return (USB_ERROR);
}
/******************************************************************************
 End of function usb_hhub_chk_tbl_indx2
 ******************************************************************************/

