tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_device_descrip_info
 Description     : device descriptor info
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_device_descrip_info (usb_utr_t *ptr)
{
    /* Condition compilation by the difference of useful function */
#ifdef USB_DEBUG_ON
    uint8_t *p;

    p = usb_hstd_dev_descriptor(ptr);

    /* For DEMO */
    USB_PRINTF0("Device descriptor fields\n");
    USB_PRINTF2("  bcdUSB         : %02x.%02x\n", p[0x03], p[0x02]);
    USB_PRINTF1("  bDeviceClass   : 0x%02x\n", p[0x04]);
    USB_PRINTF1("  bDeviceSubClass: 0x%02x\n", p[0x05]);
    USB_PRINTF1("  bProtocolCode  : 0x%02x\n", p[0x06]);
    USB_PRINTF1("  bMaxPacletSize : 0x%02x\n", p[0x07]);
    USB_PRINTF2("  idVendor       : 0x%02x%02x\n", p[0x09], p[0x08]);
    USB_PRINTF2("  idProduct      : 0x%02x%02x\n", p[0x0b], p[0x0a]);
    USB_PRINTF2("  bcdDevice      : 0x%02x%02x\n", p[0x0d], p[0x0c]);
    USB_PRINTF1("  iSerialNumber  : 0x%02x\n", p[0x10]);
    USB_PRINTF1("  bNumConfig     : 0x%02x\n", p[0x11]);
    USB_PRINTF0("\n");
#endif  /* USB_DEBUG_ON */
}
/******************************************************************************
 End of function usb_hhub_device_descrip_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_config_descrip_info
 Description     : configuration descriptor info
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_config_descrip_info (usb_utr_t *ptr)
{
    /* Condition compilation by the difference of useful function */
#ifdef USB_DEBUG_ON
    uint8_t *p;
    uint16_t len;

    p = usb_hstd_con_descriptor(ptr);

    len = 0;
    while (len < (p[2]))
    {
        /* Search within Configuration descriptor */
        switch (p[len + 1])
        {
            /* Configuration Descriptor ? */
            case 0x02:
            USB_PRINTF0("Configuration descriptor fields\n");
            USB_PRINTF1("  Configuration Value  : 0x%02x\n", p[0x05]);
            USB_PRINTF1("  Number of Interface  : 0x%02x\n", p[0x04]);
            break;
            /* Interface Descriptor ? */
            case 0x04:
            USB_PRINTF0("\nInterface descriptor fields\n");
            switch (p[len + 5])
            {
                /* Class check */
                /* Audio Class */
                case 1:
                USB_PRINTF0("  This device has Audio Class.\n");
                break;
                /* CDC-Control Class */
                case 2:
                USB_PRINTF0("  This device has CDC-Control Class.\n");
                break;
                /* HID Class */
                case 3:
                USB_PRINTF0("  This device has HID Class.\n");
                break;
                /* Physical Class */
                case 5:
                USB_PRINTF0("  This device has Physical Class.\n");
                break;
                /* Image Class */
                case 6:
                USB_PRINTF0("  This device has Image Class.\n");
                break;
                /* Printer Class */
                case 7:
                USB_PRINTF0("  This device has Printer Class.\n");
                break;
                /* Mass Storage Class */
                case 8:
                USB_PRINTF0("  I/F class    : Mass Storage\n");
                switch (p[len + 6])
                {
                    case 0x05:
                    USB_PRINTF0("  I/F subclass : SFF-8070i\n");
                    break;
                    case 0x06:
                    USB_PRINTF0("  I/F subclass : SCSI command\n");
                    break;
                    default:
                    USB_PRINTF0("### I/F subclass not support.\n");
                }
                if (0x50 == p[ len + 7 ])
                {
                    /* Check Interface Descriptor (protocol) */
                    USB_PRINTF0("  I/F protocol : BOT\n");
                }
                else
                {
                    USB_PRINTF0("### I/F protocol not support.\n");
                }
                break;
                /* HUB Class */
                case 9:
                USB_PRINTF0("  This device has HUB Class.\n");
                break;
                /* CDC-Data Class */
                case 10:
                USB_PRINTF0("  This device has CDC-Data Class.\n");
                break;
                /* Chip/Smart Card Class */
                case 11:
                USB_PRINTF0("  This device has Chip/Smart Class.\n");
                break;
                /* Content-Security Class */
                case 13:
                USB_PRINTF0("  This device has Content-Security Class.\n");
                break;
                /* Video Class */
                case 14:
                USB_PRINTF0("  This device has Video Class.\n");
                break;
                /* Vendor Specific Class */
                case 255:
                USB_PRINTF0("  I/F class : Vendor Specific\n");
                break;
                /* Reserved */
                case 0:
                USB_PRINTF0("  I/F class : class error\n");
                break;
                default:
                USB_PRINTF0("  This device has not USB Device Class.\n");
                break;
            }
            break;
            /* Endpoint Descriptor */
            case 0x05:
            usb_hhub_endp_descrip_info(&p[len]);
            break;
            default:
            break;
        }
        len += p[len];
    }
#endif  /* USB_DEBUG_ON */
}
/******************************************************************************
 End of function usb_hhub_config_descrip_info
 ******************************************************************************/

