tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/* Condition compilation by the difference of useful function */
#ifdef USB_DEBUG_ON
/******************************************************************************
 Function Name   : usb_hhub_endp_descrip_info
 Description     : endpoint descriptor info
 Arguments       : uint8_t *tbl     : table (indata).
 Return value    : none
 ******************************************************************************/
static void usb_hhub_endp_descrip_info(uint8_t *tbl)
{
    uint16_t epnum, pipe_mxp;

    switch ((uint8_t)(tbl[3] & USB_EP_TRNSMASK))
    {
        /* Isochronous Endpoint */
        case USB_EP_ISO:
        USB_PRINTF0("  ISOCHRONOUS");
        break;
        /* Bulk Endpoint */
        case USB_EP_BULK:
        USB_PRINTF0("  BULK");
        break;
        /* Interrupt Endpoint */
        case USB_EP_INT:
        USB_PRINTF0("  INTERRUPT");
        break;
        /* Control Endpoint */
        default:
        USB_PRINTF0("### Control pipe is not support.\n");
        break;
    }

    if (USB_EP_IN == (uint8_t)(tbl[2] & USB_EP_DIRMASK))
    {
        /* Endpoint address set */
        USB_PRINTF0(" IN  endpoint\n");
    }
    else
    {
        USB_PRINTF0(" OUT endpoint\n");
    }
    /* Endpoint number set */
    epnum = (uint16_t)((uint16_t)tbl[2] & USB_EP_NUMMASK);
    /* Max packet size set */
    pipe_mxp = (uint16_t)(tbl[4] | (uint16_t)((uint16_t)(tbl[5]) << 8));
    USB_PRINTF2("   Number is %d. MaxPacket is %d. \n", epnum, pipe_mxp);
    switch ((uint16_t)(tbl[3] & USB_EP_TRNSMASK))
    {
        /* Isochronous Endpoint */
        case 0x01u:
        /* Interrupt Endpoint */
        case 0x03u:
        USB_PRINTF1("    interval time is %d\n", tbl[6]);
        break;
        default:
        break;
    }
}
/******************************************************************************
 End of function usb_hhub_endp_descrip_info
 ******************************************************************************/
#endif  /* USB_DEBUG_ON */

/******************************************************************************
 Function Name   : usb_hhub_new_connect
 Description     : new connect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
                 : usb_clsinfo_t *mess  : Pointer to usb_clsinfo_t structure
 Return value    : none
 ******************************************************************************/
static void usb_hhub_new_connect (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess)
{
    uint16_t devaddr;

    hubaddr = g_usb_shhub_hub_addr[ptr->ip];
    portnum = g_usb_shhub_event_port[ptr->ip];

    /* New downport device search */
    devaddr = usb_hhub_get_new_devaddr(ptr);
    if (0 != devaddr)
    {
        USB_PRINTF1(" Hubport connect address%d\n", devaddr);
        g_usb_shhub_info_data[ptr->ip][devaddr].up_addr = hubaddr; /* Up-hubaddr set */
        g_usb_shhub_info_data[ptr->ip][devaddr].up_port_num = portnum; /* Up-hubport set */
        g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_ATTACH;
        usb_hhub_specified_path(mess); /* Next Process Selector */

    }
    else
    {
        USB_PRINTF0("### device count over !\n");
    }
}
/******************************************************************************
 End of function usb_hhub_new_connect
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_port_detach
 Description     : HUB down port disconnect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
 Return value    : none
 ******************************************************************************/
static void usb_hhub_port_detach (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum)
{
    uint16_t md;
    usb_hcdreg_t *driver;

    /* Device number --> DeviceAddress */
    uint16_t devaddr;

    /* HUB downport status */
    g_usb_shhub_down_port[ptr->ip][hubaddr] &= (uint16_t) (~USB_BITSET(portnum));

    /* HUB downport RemoteWakeup */
    g_usb_shhub_remote[ptr->ip][hubaddr] &= (uint16_t) (~USB_BITSET(portnum));

    /* Now downport device search */
    devaddr = usb_hhub_get_cnn_devaddr(ptr, hubaddr, portnum);
    for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
    {
        driver = &g_usb_hstd_device_drv[ptr->ip][md];
        if (devaddr == driver->devaddr)
        {
            if (USB_NULL == driver->devdetach)   /* Chack Callback function */
            {
                while(1)
                {
                    /* Error Stop */
                }
            }
            (*driver->devdetach)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

            /* Root port */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][0] = USB_NOPORT;

            /* Device state */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_DETACHED;

            /* Not configured */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][2] = (uint16_t) 0;

            /* Interface Class : NO class */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][3] = (uint16_t) USB_IFCLS_NOT;

            /* No connect */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][4] = (uint16_t) USB_NOCONNECT;

            /* Root port */
            driver->rootport = USB_NOPORT;

            /* Device address */
            driver->devaddr = USB_NODEVICE;

            /* Device state */
            driver->devstate = USB_DETACHED;
        }
    }

    /* Selective detach */
    usb_hhub_selective_detach(ptr, devaddr);
}
/******************************************************************************
 End of function usb_hhub_port_detach
 ******************************************************************************/

