tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_selective_detach
 Description     : HUB down port Selective disconnect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  devadr     : Device address
 Return value    : none
 ******************************************************************************/
static void usb_hhub_selective_detach (usb_utr_t *ptr, uint16_t devaddr)
{
    uint16_t addr, i;

    addr = (uint16_t) (devaddr << USB_DEVADDRBIT);

    /* Check Connection */
    if (USB_NOCONNECT != usb_hstd_get_dev_speed(ptr, addr))
    {
        for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
        {
            /* Not control transfer */
            if (usb_hstd_get_device_address(ptr, i) == addr)
            {
                /* Agreement device address */
                if (USB_PID_BUF == usb_cstd_get_pid(ptr, i))
                {
                    /* PID=BUF ? */
                    usb_hstd_transfer_end(ptr, i, (uint16_t) USB_DATA_STOP);
                }
                usb_cstd_clr_pipe_cnfg(ptr, i);
            }
        }
        usb_hstd_set_dev_addr(ptr, addr, USB_OK, USB_OK);
        usb_hstd_set_hub_port(ptr, addr, USB_OK, USB_OK);
        USB_PRINTF1("*** Device address %d clear.\n", devaddr);
    }

    /* Root port */
    g_usb_hstd_device_info[ptr->ip][devaddr][0] = USB_NOPORT;

    /* Device state */
    g_usb_hstd_device_info[ptr->ip][devaddr][1] = USB_DETACHED;

    /* Not configured */
    g_usb_hstd_device_info[ptr->ip][devaddr][2] = (uint16_t) 0;

    /* Interface Class : NO class */
    g_usb_hstd_device_info[ptr->ip][devaddr][3] = (uint16_t) USB_IFCLS_NOT;

    /* No connect */
    g_usb_hstd_device_info[ptr->ip][devaddr][4] = (uint16_t) USB_NOCONNECT;

}
/******************************************************************************
 End of function usb_hhub_selective_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor1
 Description     : Get String descriptor
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t devaddr     : Device address
                 : uint16_t index       : Descriptor index
                 : usb_cb_t complete    : Callback function
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor1 (usb_utr_t *ptr, uint16_t devaddr, uint16_t index, usb_cb_t complete)
{
    usb_hstd_get_string_desc(ptr, devaddr, (uint16_t) 0, complete);

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor1
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor2
 Description     : Get String descriptor
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t devaddr     : Device address
                 : uint16_t index       : Descriptor index
                 : usb_cb_t complete    : Callback function
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor2 (usb_utr_t *ptr, uint16_t devaddr, uint16_t index, usb_cb_t complete)
{
    usb_hstd_get_string_desc(ptr, devaddr, index, complete);

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor2
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor1check
 Description     : Get String descriptor Check
 Arguments       : uint16_t errcheck    : errcheck
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor1check (uint16_t errcheck)
{
    if ((usb_er_t) USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else if ((usb_er_t) USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor1check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor_to_check
 Description     : Get String descriptor Check
 Arguments       : uint16_t errcheck         : errcheck
 Return value    : uint16_t                  : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor_to_check (uint16_t errcheck)
{
    if ((usb_er_t) USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** SerialNumber not support !\n");
        return USB_ERROR;
    }
    else if ((usb_er_t) USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** SerialNumber not support !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor_to_check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_new_devaddr
 Description     : Get the new device address
                 : when connection of a device detected in the down port of HUB
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
 Return value    : uint16_t             : Device address
 ******************************************************************************/
static uint16_t usb_hhub_get_new_devaddr (usb_utr_t *ptr)
{
    uint16_t i;

    /* Search new device */
    for (i = (USB_HUBDPADDR); i < (USB_MAXDEVADDR + 1u); i++)
    {
        if (0 == g_usb_shhub_info_data[ptr->ip][i].up_addr)
        {
            /* New device address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_new_devaddr
 ******************************************************************************/

