tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_get_hubaddr
 Description     : Get the HUB address
                 : from the pipe number for HUB notification
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t pipenum     : Pipe number
 Return value    : uint16_t             : HUB address
 ******************************************************************************/
static uint16_t usb_hhub_get_hubaddr (usb_utr_t *ptr, uint16_t pipenum)
{
    uint16_t i;

    for (i = 1; i < (USB_MAXDEVADDR + 1u); i++)
    {
        if (g_usb_shhub_info_data[ptr->ip][i].pipe_num == pipenum)
        {
            /* HUB address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_hubaddr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_cnn_devaddr
 Description     : Get the connected device address
                 : from the HUB address and the down port number of a HUB
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
 Return value    : uint16_t             : Connected device address
 ******************************************************************************/
static uint16_t usb_hhub_get_cnn_devaddr (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum)
{
    uint16_t i;

    for (i = (USB_HUBDPADDR); i < (USB_MAXDEVADDR + 1u); i++)
    {
        if ((g_usb_shhub_info_data[ptr->ip][i].up_addr == hubaddr)
                && (g_usb_shhub_info_data[ptr->ip][i].up_port_num == portnum))
        {
            /* Device address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_cnn_devaddr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_specified_path
 Description     : Next Process Selector
 Arguments       : usb_clsinfo_t *ptr    : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_specified_path (usb_clsinfo_t *ptr)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = g_usb_shhub_process[ptr->ip];
        cp->keyword = ptr->keyword;
        cp->result = ptr->result;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Send message */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            /* Send message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### SpecifiedPass function snd_msg error\n");
        }
    }
    else
    {
        /* Get memoryblock failure */
        USB_PRINTF0("### SpecifiedPass function pget_blk error\n");
        while (1)
        {
            /* Non */
        }
    }
}
/******************************************************************************
 End of function usb_hhub_specified_path
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_specified_path_wait
 Description     : Next Process Selector
 Arguments       : usb_clsinfo_t *mess    : USB system internal message.
                 : uint16_t times         : Timeout value.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_specified_path_wait (usb_clsinfo_t *ptr, uint16_t times)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *hp;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        hp = (usb_clsinfo_t*) p_blf;
        hp->msginfo = g_usb_shhub_process[ptr->ip];
        hp->keyword = ptr->keyword;
        hp->result = ptr->result;

        hp->ipp = ptr->ipp;
        hp->ip = ptr->ip;

        /* Wait message */
        err = USB_WAI_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf, times);
        if (USB_OK != err)
        {
            /* Wait message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### SpecifiedPassWait function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### SpecifiedPassWait function pget_blk error\n");
        while (1)
        {
            /* Non */
        }
    }
}
/******************************************************************************
 End of function usb_hhub_specified_path_wait
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End  Of File
 ******************************************************************************/
